var myChart = echarts.init(document.getElementById('疫情分布'));
// var myColor = ["#FFFF00", "orange",  "#FFB6C1", "#00FFFF","#FF00FF",   "#FFA07A", "#BA55D3", "#FF6347", "#FF0000"]
myChart.setOption(
option = {
    dataZoom: [{
        show: true,
        height: 30,
        xAxisIndex: [0],
        bottom: 15,
        right:"center",

        "start": 5,
        "end": 60,
        handleIcon: 'path://M306.1,413c0,2.2-1.8,4-4,4h-59.8c-2.2,0-4-1.8-4-4V200.8c0-2.2,1.8-4,4-4h59.8c2.2,0,4,1.8,4,4V413z',
        handleSize: '110%',
        handleStyle: {
            color: "#5B3AAE",
        },
        textStyle: {
            color: "rgba(204,187,225,0.5)",
        },
        fillerColor: "rgba(67,55,160,0.4)",
        borderColor: "rgba(204,187,225,0.5)",

    }, {
        type: "inside",
        show: true,
        height: 15,
        start: 1,
        end: 35
    }],
    // backgroundColor: "#05224d",
    tooltip: {
        tooltip:{
            show:true ,
      
          },
    },
    grid: {
        top: '8%',
        left: '1%',
        right: '1%',
        bottom: '8%',
        containLabel: true,
    },
    legend: {
        itemGap: 30,
        data: ['新增确诊病例','新增疑似病例','新增死亡病例','累计确诊病例','累计疑似病例','累计死亡病例'],
        textStyle: {
            color: '#fff',
            borderColor: '#fff'
        },
        selected:{
            "累计疑似病例":false ,
            "累计确诊病例":false,
            "累计死亡病例":false
        },
    },
    xAxis: [{
        type: 'category',
        boundaryGap: true,
        axisLine: { //坐标轴轴线相关设置。数学上的x轴
            show: true,
            lineStyle: {
                color: '#fff'
            },
        },
        axisLabel: { //坐标轴刻度标签的相关设置
            textStyle: {
                color: '#fff',
                margin: 15,
            },
        },
        axisTick: {
            show: false,
        },
        data: ["01-16", "01-17", "01-18", "01-19", "01-20", "01-21", "01-22", "01-23", "01-24", "01-25", "01-26", "01-27", "01-28", "01-29", "1-30", "01-31", "02-01", "02-02", "02-03", "02-04", "02-05", "02-06", "02-07", "02-08", "02-09", "02-10", "02-11", "02-12", "02-13", "02-14", "02-15", "02-16", "02-17", "02-18", "02-19", "02-20", "02-21", "02-22", "02-23", "02-24", "02-25", "02-26", "02-27", "02-28", "02-29", "03-01", "03-02", "03-03", "03-04", "03-05", "03-06", "03-07", "03-08", "03-09", "03-10", "03-11", "03-12", "03-13", "03-14", "03-15", "03-16", "03-17", "03-18", "03-19", "03-20", "03-21", "03-22", "03-23", "03-24", "03-25", "03-26", "03-27", "03-28", "03-29", "03-30", "03-31", "04-01", "04-02", "04-03", "04-04", "04-05", "04-06", "04-07", "04-08", "04-09", "04-10", "04-11", "04-12", "04-13", "04-14", "04-15", "04-16", "04-17", "04-18", "04-19", "04-20", "04-21", "04-22", "04-23", "04-24", "04-25", "04-26"],
    }],
    yAxis: [{
        type: 'value',
        min: 0,
        // max: 140,
        splitNumber: 7,
        splitLine: {
            show: true,
            lineStyle: {
                color: '#0a3256'
            }
        },
        axisLine: {
            show: false,
        },
        axisLabel: {
            margin: 20,
            textStyle: {
                color: '#fff',

            },
        },
        axisTick: {
            show: false,
        },
    }],
    // color:myColor,
    series: [{
        name: '累计疑似病例',
        type: 'line',
         smooth: true, //是否平滑曲线显示
         			symbol:'circle',  // 默认是空心圆（中间是白色的），改成实心圆
        showAllSymbol: true,
        symbol: 'emptyCircle',
        symbolSize: 6,
        lineStyle: {
             normal: {
                 color: "#FFB6C1", // 线条颜色
             },
            borderColor: '#f0f'
        },
        label: {
            show: false,
            // position: 'top',
            // textStyle: {
            //     color: '#fff',
            // }
        },
         itemStyle: {
             normal: {
                 color: "#FFB6C1",

             }
         },
        tooltip: {
            show: true
        },
        areaStyle: { //区域填充样式
            normal: {
                //线性渐变，前4个参数分别是x0,y0,x2,y2(范围0~1);相当于图形包围盒中的百分比。如果最后一个参数是‘true’，则该四个值是绝对像素位置。
                color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [{
                        offset: 0,
                        color: '#FFB6C1'
                    },
                    {
                        offset: 1,
                        color: 'rgba(0,0,0, 0)'
                    }
                ], false),
                shadowColor: 'rgba(53,142,215, 0.9)', //阴影颜色
                shadowBlur: 20 //shadowBlur设图形阴影的模糊大小。配合shadowColor,shadowOffsetX/Y, 设置图形的阴影效果。
            }
        },
        data: ["0","0","0","0","54","37","393","1072","1965","2684","5794","6973","9239","12167","15238","17988","19544","21558","23214","23260","24702","26359","27657","28942","23589","21675","16067","13435","10109","8969","8228","7264","6242","5248","4922","5206","5365","4148","3434","2824","2491","2358","2308","1418","851","715","587","520","522","482","502","458","421","349","285","253","147","115","113","134","128","119","105","104","106","118","136","132","134","159","189","184","174","168","183","172","153","135","114","107","88","89","83","73","53","44","82","72","72","73","63","62","63","48","43","37","35","20","20","17","12","10"],
    }, {
        name: '累计确诊病例',
        type: 'line',
         smooth: true, //是否平滑曲线显示
         			symbol:'circle',  // 默认是空心圆（中间是白色的），改成实心圆
        showAllSymbol: true,
        symbol: 'emptyCircle',
        symbolSize: 6,
        lineStyle: {
            normal: {
                color: "#BA55D3", // 线条颜色
            },
            borderColor: '#f0f'
        },
        label: {
            show: false,
            // position: 'top',
            // textStyle: {
            //     color: '#fff',
            // }
        },
        itemStyle: {
            normal: {
                color: "#BA55D3",

            }
        },
        tooltip: {
            show: true
        },
        areaStyle: { //区域填充样式
            normal: {
                //线性渐变，前4个参数分别是x0,y0,x2,y2(范围0~1);相当于图形包围盒中的百分比。如果最后一个参数是‘true’，则该四个值是绝对像素位置。
                color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [{
                        offset: 0,
                        color: '#BA55D3'
                    },
                    {
                        offset: 1,
                        color: 'rgba(0,0,0, 0)'
                    }
                ], false),
                shadowColor: 'rgba(53,142,215, 0.9)', //阴影颜色
                shadowBlur: 20 //shadowBlur设图形阴影的模糊大小。配合shadowColor,shadowOffsetX/Y, 设置图形的阴影效果。
            }
        },
        data: ["45","62","121","198","291","443","574","835","1297","1985","2761","4533","5995","7736","9720","11821","14411","17238","20471","24363","28060","31211","34598","37251","40235","42708","44730","59882","63932","66576","68584","70635","72528","74279","75101","75993","76392","77041","77262","77779","78190","78630","78959","79389","79968","80174","80302","80422","80565","80710","80813","80859","80904","80924","80955","80980","80991","81021","81048","81077","81116","81151","81235","81300","81416","81498","81600","81747","81846","81960","82078","82213","82341","82447","82545","82631","82724","82802","82875","82930","83005","83071","83157","83249","83305","83369","83482","83597","83696","83745","83797","84149","84180","84201","84237","84250","84287","84302","84311","84324","84338","84341"],
    },{
        name: '累计死亡病例',
        type: 'line',
         smooth: true, //是否平滑曲线显示
         			symbol:'circle',  // 默认是空心圆（中间是白色的），改成实心圆
        showAllSymbol: true,
        symbol: 'emptyCircle',
        symbolSize: 6,
        lineStyle: {
            normal: {
                color: "#00FFFF", // 线条颜色
            },
            borderColor: '#f0f'
        },
        label: {
            show: false,
            // position: 'top',
            // textStyle: {
            //     color: '#fff',
            // }
        },
        itemStyle: {
            normal: {
                color: "#00FFFF",

            }
        },
        tooltip: {
            show: true
        },
        areaStyle: { //区域填充样式
            normal: {
                //线性渐变，前4个参数分别是x0,y0,x2,y2(范围0~1);相当于图形包围盒中的百分比。如果最后一个参数是‘true’，则该四个值是绝对像素位置。
                color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [{
                        offset: 0,
                        color: '#00FFFF'
                    },
                    {
                        offset: 1,
                        color: 'rgba(0,0,0, 0)'
                    }
                ], false),
                shadowColor: 'rgba(53,142,215, 0.9)', //阴影颜色
                shadowBlur: 20 //shadowBlur设图形阴影的模糊大小。配合shadowColor,shadowOffsetX/Y, 设置图形的阴影效果。
            }
        },
        data: ["2","2","3","4","6","9","17","25","41","56","80","106","132","170","213","259","304","361","425","491","564","637","723","812","909","1017","1114","1368","1381","1524","1666","1772","1870","2006","2121","2239","2348","2445","2595","2666","2718","2747","2791","2838","2873","2915","2946","2984","3015","3045","3073","3100","3123","3140","3162","3173","3180","3194","3204","3218","3231","3242","3250","3253","3261","3267","3276","3283","3287","3293","3298","3301","3306","3311","3314","3321","3327","3331","3335","3338","3340","3340","3342","3344","3345","3349","3349","3351","3351","3352","3352","4642","4642","4642","4642","4642","4642","4642","4642","4642","4642","4643"],
    },
    {
        name: '新增疑似病例',
        type: 'bar',
        barWidth: 4,
        tooltip: {
            show: true
        },
         label: {
            show: false,
            // position: 'top',
            // textStyle: {
            //     color: '#fff',
            // }
        },
        itemStyle: {
            normal: {
                 barBorderRadius: 5,
                 color: new echarts.graphic.LinearGradient(
                     0, 0, 0, 1,
                     [{
                            offset: 0,
                             color: '#14c8d4'
                         },
                        {
                             offset: 1,
                            color: '#43eec6'
                        }
                    ]
                 ),
                color: "#FFFF00"
            }
        },
        data: ["0","0","0","0","27","26","257","680","1118","1309","3806","2077","3248","4148","4812","5019","4562","5173","5072","3971","5328","4833","4214","3916","4008","3536","3342","2807","2450","2277","1918","1563","1432","1185","1277","1614","1361","882","620","530","439","508","452","248","132","141","129","143","143","102","99","84","60","36","31","33","33","17","39","41","45","21","23","31","36","45","47","35","33","58","49","29","28","17","44","26","20","12","11","11","10","12","12","17","3","8","49","6","3","11","4","3","5","2","2","3","3","0","2","3","0","5"],
    },
    {
        name: '新增确诊病例',
        type: 'bar',
        barWidth: 4,
        tooltip: {
            show: true
        },
         label: {
            show: false,
            // position: 'top',
            // textStyle: {
            //     color: '#fff',
            // }
        },
        itemStyle: {
            normal: {
                 barBorderRadius: 5,
                 color: new echarts.graphic.LinearGradient(
                     0, 0, 0, 1,
                     [{
                             offset: 0,
                             color: '#14c8d4'
                         },
                         {
                             offset: 1,
                             color: '#43eec6'
                         }
                     ]
                 ),
                color:"orange", 
            }
        },
        data: ["4","17","59","77","77","152","131","261","449","688","776","1772","1462","1741","1985","2104","2591","2831","3235","3893","3697","3151","3401","2657","3073","2484","2022","15153","5093","2644","2009","2051","1891","1751","825","892","399","649","416","517","411","440","329","430","579","206","128","120","143","145","103","46","45","20","31","25","11","18","27","29","39","35","84","65","116","82","102","147","99","114","118","135","128","106","98","86","93","78","73","55","75","66","86","92","56","64","113","115","99","49","52","27","31","21","36","13","37","15","9","13","14","3"],
    },
    {
        name: '新增死亡病例',
        type: 'bar',
        barWidth: 4,
        tooltip: {
            show: true
        },
         label: {
            show: false,
            // position: 'top',
            // textStyle: {
            //     color: '#fff',
            // }
        },
        itemStyle: {
            normal: {
                 barBorderRadius: 5,
                 color: new echarts.graphic.LinearGradient(
                    0, 0, 0, 1,
                    [{
                     offset: 0,
                            color: '#14c8d4'
                        },
                        {
                             offset: 1,
                            color: '#43eec6'
                        }
                   ]
                ),
                color: "#FF00FF",
            }
        },
        data: ["1","0","1","1","2","3","8","8","16","15","24","26","26","38","43","46","45","57","64","66","73","73","86","89","97","108","97","254","121","143","142","106","98","136","115","118","109","97","150","71","52","29","44","47","35","42","31","38","31","30","28","27","23","17","22","11","7","14","10","14","13","11","8","3","8","6","9","7","4","6","5","3","5","5","3","7","6","4","4","3","1","0","2","2","1","4","0","2","0","1","0","0","0","0","0","0","0","0","0","0","0","0"],
    }]
})