var duli_numbers = new Array()
var increase = new Array()
var type =  new Array()
var  zuobiao = new Array()


// type = ['学而思网校','猿辅导','家校帮','腾讯课堂','猿题库','中国大学mooc','盒子学生','学习通','学乐云教学','CCTalk互动直播课堂']

title = ['2月学习教育行业机构增长-用时长']

type = ['CCTalk互动直播课堂','作业帮一课','盒子学生','猿辅导','哈哈文库-千阳远里','翼课学生','家校帮','学而思网校','天天乐学','一起中学学生']

// duli_numbers = [4.98,3.63,2.10,3.40,1.13,1.21,1.29,2.28,1.07,0.56]

duli_numbers = [21.44,9.24,16.15,23.34,13.84,9.58,16.37,3.87,6.83,15.59]
// increase = [314.5,209.2,195.8,144.6,110.9,81.7,74.4,74.0,64.5,54.7]
increase = [793.3,153.2,116.2,111.2,93.3,70.8,63.4,57.3,56.7,50.5]

zuobiao = ['单机日使用时长(分)','环比增长率']