var  numbers1 = new Array()
var  numbers2 = new Array()
var type = new Array()
var rate1 = new Array()
var rate2 = new Array()
var rate3 = new Array()


title = ['2.3-3.15外卖行业总体变化']

// date = ['201909','201910','201911','201912','202001','202002']
date = ['2.3-2.9','2.9-2.16','2.17-2.23','2.24-3.1','3.2-3.8','3.9-3.15']

// numbers = [16.18,14.91,15.19,16.33,15.43,14.60]
numbers1 = [1.81,1.78,1.84,1.96,1.97,2.05]

numbers2 = [14.08,14.01,14.80,16.21,17.21,17.98]

rate1 = [1.0,-1.4,3.5,6.4,0.6,4.2]

rate2 = [0.5,-0.5,5.6,9.5,6.2,4.5]

type = ['周独立设备数(千万台)','(1)环比增长率','一周总使用次数(次)','(2)环比增长率']
