var  numbers1 = new Array()
var  numbers2 = new Array()
var type = new Array()
var rate1 = new Array()



title = ['春节后生鲜电商日均活跃用户数总体变化']

// date = ['201909','201910','201911','201912','202001','202002']
date = ['节后第1天','节后第2天','节后第3天','节后第4天','节后第5天','节后第6天','节后第7天']

// numbers = [16.18,14.91,15.19,16.33,15.43,14.60]
numbers1 = [372.2,351.0,368.2,358.0,351.2,358.5,366.5]

numbers2 = [332.9,324.3,316.2,253.3,254.3,252.9,252.1]

rate1 = [11.8,8.2,16.4,41.3,38.1,41.8,45.4]

type = ['2020年(万台)','2019年(万台)','增长率(%)']
