var  numbers1 = new Array()
var  numbers2 = new Array()
var type = new Array()
var rate1 = new Array()
var rate2 = new Array()
var rate3 = new Array()


title = ['2020 2.3-3.15饿了吗总体变化']

// date = ['201909','201910','201911','201912','202001','202002']
date = ['2.3-2.9','2.9-2.16','2.17-2.23','2.24-3.1','3.2-3.8','3.9-3.15']

// numbers = [16.18,14.91,15.19,16.33,15.43,14.60]
numbers1 = [8.92,8.81,8.88,9.12,9.21,9.69]

numbers2 = [0.65,0.63,0.80,0.94,1.09,1.24]

rate1 = [1.0,-1.3,0.8,2.7,1.0,5.2]

rate2 = [0.5,-4.4,20.8,37.9,13.4,17.3]

type = ['周独立设备数(千万台)','(1)环比增长率','商家-周独立设备数(千万台)','(2)环比增长率']
