/*series.lines主要用于迁徙图，攻击线等
geoCoorMap提供各城市经纬度坐标，
地图上标点、标线都需要通过坐标进行 
BJData、SHData、GZData是城市间连线的原始数据*/

//实例化对象
var myChart = echarts.init(document.querySelector(".qianximap .chart"));
var geoCoordMap = {
    '上海': [121.4648, 31.2891],
    '东莞': [113.8953, 22.901],
    '东营': [118.7073, 37.5513],
    '中山': [113.4229, 22.478],
    '临汾': [111.4783, 36.1615],
    '临沂': [118.3118, 35.2936],
    '丹东': [124.541, 40.4242],
    '丽水': [119.5642, 28.1854],
    '乌鲁木齐': [87.9236, 43.5883],
    '佛山': [112.8955, 23.1097],
    '保定': [115.0488, 39.0948],
    '兰州': [103.5901, 36.3043],
    '包头': [110.3467, 41.4899],
    '北京': [116.4551, 40.2539],
    '北海': [109.314, 21.6211],
    '南京': [118.8062, 31.9208],
    '南宁': [108.479, 23.1152],
    '南昌': [116.0046, 28.6633],
    '南通': [121.1023, 32.1625],
    '厦门': [118.1689, 24.6478],
    '台州': [121.1353, 28.6688],
    '合肥': [117.29, 32.0581],
    '呼和浩特': [111.4124, 40.4901],
    '咸阳': [108.4131, 34.8706],
    '哈尔滨': [127.9688, 45.368],
    '唐山': [118.4766, 39.6826],
    '嘉兴': [120.9155, 30.6354],
    '大同': [113.7854, 39.8035],
    '大连': [122.2229, 39.4409],
    '天津': [117.4219, 39.4189],
    '太原': [112.3352, 37.9413],
    '威海': [121.9482, 37.1393],
    '宁波': [121.5967, 29.6466],
    '宝鸡': [107.1826, 34.3433],
    '宿迁': [118.5535, 33.7775],
    '常州': [119.4543, 31.5582],
    '广州': [113.5107, 23.2196],
    '廊坊': [116.521, 39.0509],
    '延安': [109.1052, 36.4252],
    '张家口': [115.1477, 40.8527],
    '徐州': [117.5208, 34.3268],
    '德州': [116.6858, 37.2107],
    '惠州': [114.6204, 23.1647],
    '成都': [103.9526, 30.7617],
    '扬州': [119.4653, 32.8162],
    '承德': [117.5757, 41.4075],
    '拉萨': [91.1865, 30.1465],
    '无锡': [120.3442, 31.5527],
    '日照': [119.2786, 35.5023],
    '昆明': [102.9199, 25.4663],
    '杭州': [119.5313, 29.8773],
    '枣庄': [117.323, 34.8926],
    '柳州': [109.3799, 24.9774],
    '株洲': [113.5327, 27.0319],
    '武汉': [114.3896, 30.6628],
    '汕头': [117.1692, 23.3405],
    '江门': [112.6318, 22.1484],
    '沈阳': [123.1238, 42.1216],
    '沧州': [116.8286, 38.2104],
    '河源': [114.917, 23.9722],
    '泉州': [118.3228, 25.1147],
    '泰安': [117.0264, 36.0516],
    '泰州': [120.0586, 32.5525],
    '济南': [117.1582, 36.8701],
    '济宁': [116.8286, 35.3375],
    '海口': [110.3893, 19.8516],
    '淄博': [118.0371, 36.6064],
    '淮安': [118.927, 33.4039],
    '深圳': [114.5435, 22.5439],
    '清远': [112.9175, 24.3292],
    '温州': [120.498, 27.8119],
    '渭南': [109.7864, 35.0299],
    '湖州': [119.8608, 30.7782],
    '湘潭': [112.5439, 27.7075],
    '滨州': [117.8174, 37.4963],
    '潍坊': [119.0918, 36.524],
    '烟台': [120.7397, 37.5128],
    '玉溪': [101.9312, 23.8898],
    '珠海': [113.7305, 22.1155],
    '盐城': [120.2234, 33.5577],
    '盘锦': [121.9482, 41.0449],
    '石家庄': [114.4995, 38.1006],
    '福州': [119.4543, 25.9222],
    '秦皇岛': [119.2126, 40.0232],
    '绍兴': [120.564, 29.7565],
    '聊城': [115.9167, 36.4032],
    '肇庆': [112.1265, 23.5822],
    '舟山': [122.2559, 30.2234],
    '苏州': [120.6519, 31.3989],
    '莱芜': [117.6526, 36.2714],
    '菏泽': [115.6201, 35.2057],
    '营口': [122.4316, 40.4297],
    '葫芦岛': [120.1575, 40.578],
    '衡水': [115.8838, 37.7161],
    '衢州': [118.6853, 28.8666],
    '西宁': [101.4038, 36.8207],
    '西安': [109.1162, 34.2004],
    '贵阳': [106.6992, 26.7682],
    '连云港': [119.1248, 34.552],
    '邢台': [114.8071, 37.2821],
    '邯郸': [114.4775, 36.535],
    '郑州': [113.4668, 34.6234],
    '鄂尔多斯': [108.9734, 39.2487],
    '重庆': [107.7539, 30.1904],
    '金华': [120.0037, 29.1028],
    '铜川': [109.0393, 35.1947],
    '银川': [106.3586, 38.1775],
    '镇江': [119.4763, 31.9702],
    '长春': [125.8154, 44.2584],
    '长沙': [113.0823, 28.2568],
    '长治': [112.8625, 36.4746],
    '阳泉': [113.4778, 38.0951],
    '青岛': [120.4651, 36.3373],
    '韶关': [113.7964, 24.7028]
};
var allData = [
    ["廊坊市", "16.85"],
    ["保定市", "6.76"],
    ["天津市", "4.39"],
    ["张家口市", "3.66"],
    ["承德市", "3.64"],
    ["邯郸市", "3.57"],
    ["石家庄市", "1.96"],
    ["邢台市", "1.85"],
    ["唐山市", "1.68"],
    ["衡水市", "1.58"],
    ["沧州市", "1.47"],
    ["周口市", "1.21"],
    ["菏泽市", "1.09"],
    ["运城市", "1.08"],
    ["临汾市", "1.06"],
    ["赤峰市", "1.05"],
    ["德州市", "0.98"],
    ["聊城市", "0.91"],
    ["大同市", "0.88"],
    ["哈尔滨市", "0.87"],
    ["信阳市", "0.87"],
    ["南阳市", "0.82"],
    ["秦皇岛市", "0.77"],
    ["沈阳市", "0.7"],
    ["济宁市", "0.64"],
    ["安阳市", "0.64"],
    ["商丘市", "0.63"],
    ["长春市", "0.59"],
    ["济南市", "0.57"],
    ["泰安市", "0.54"],
    ["濮阳市", "0.53"],
    ["临沂市", "0.53"],
    ["驻马店市", "0.5"],
    ["郑州市", "0.5"],
    ["晋中市", "0.49"],
    ["大连市", "0.47"],
    ["朝阳市", "0.47"],
    ["西安市", "0.45"],
    ["潍坊市", "0.45"],
    ["葫芦岛市", "0.45"],
    ["青岛市", "0.44"],
    ["阜阳市", "0.44"],
    ["长治市", "0.44"],
    ["太原市", "0.43"],
    ["呼和浩特市", "0.43"],
    ["烟台市", "0.42"],
    ["通辽市", "0.41"],
    ["渭南市", "0.41"],
    ["重庆市", "0.41"],
    ["锦州市", "0.41"],
    ["毕节市", "0.39"],
    ["安庆市", "0.39"],
    ["新乡市", "0.38"],
    ["芜湖市", "0.38"],
    ["成都市", "0.37"],
    ["合肥市", "0.37"],
    ["南通市", "0.37"],
    ["忻州市", "0.36"],
    ["吉林市", "0.35"],
    ["上海市", "0.35"],
    ["齐齐哈尔市", "0.34"],
    ["牡丹江市", "0.32"],
    ["绥化市", "0.32"],
    ["乌兰察布市", "0.31"],
    ["开封市", "0.3"],
    ["吕梁市", "0.29"],
    ["鞍山市", "0.29"],
    ["宿州市", "0.28"],
    ["洛阳市", "0.28"],
    ["宝鸡市", "0.27"],
    ["长沙市", "0.27"],
    ["庆阳市", "0.27"],
    ["三亚市", "0.25"],
    ["四平市", "0.25"],
    ["徐州市", "0.25"],
    ["亳州市", "0.25"],
    ["六安市", "0.24"],
    ["朔州市", "0.24"],
    ["包头市", "0.23"],
    ["淄博市", "0.22"],
    ["滨州市", "0.22"],
    ["常德市", "0.21"],
    ["大庆市", "0.21"],
    ["枣庄市", "0.21"],
    ["阜新市", "0.21"],
    ["广州市", "0.21"],
    ["吉安市", "0.2"],
    ["丹东市", "0.2"],
    ["焦作市", "0.19"],
    ["深圳市", "0.19"],
    ["盐城市", "0.19"],
    ["松原市", "0.19"],
    ["铁岭市", "0.19"],
    ["营口市", "0.19"],
    ["岳阳市", "0.18"],
    ["威海市", "0.17"],
    ["咸阳市", "0.17"],
    ["娄底市", "0.17"],
    ["南昌市", "0.17"]
]
var res2 = [];
for (var i = 0; i < allData.length; i++) {
    allData[i][0] = allData[i][0].substr(0, allData[i].length)
    res2.push({
        name: allData[i][0],
        value: allData[i][1],
    })
}

//console.log(res);
var res1 = [{ name: '北京' }];

var BJdata = new Array();
for (var m = 0; m < res2.length; m++) {
    BJdata[m] = new Array();
    for (var n = 0; n < 2; n++) {
        BJdata[m][0] = res1[0];
        BJdata[m][1] = res2[m];
        // data[m][1].push(res2[m]);
    }
}
//console.log(data);


//  var BJData = [
//      [{ name: '北京' }, { name: '上海', value: 95 }],
//      [{ name: '北京' }, { name: '广州', value: 90 }],
//      [{ name: '北京' }, { name: '大连', value: 80 }],
//      [{ name: '北京' }, { name: '南宁', value: 70 }],
//      [{ name: '北京' }, { name: '南昌', value: 60 }],
//      [{ name: '北京' }, { name: '拉萨', value: 50 }],
//      [{ name: '北京' }, { name: '长春', value: 40 }],
//      [{ name: '北京' }, { name: '包头', value: 30 }],
//      [{ name: '北京' }, { name: '重庆', value: 20 }],
//      [{ name: '北京' }, { name: '常州', value: 10 }]
//  ];

//  var SHData = [
//      [{ name: '上海' }, { name: '包头', value: 95 }],
//      [{ name: '上海' }, { name: '昆明', value: 90 }],
//      [{ name: '上海' }, { name: '广州', value: 80 }],
//      [{ name: '上海' }, { name: '郑州', value: 70 }],
//      [{ name: '上海' }, { name: '长春', value: 60 }],
//      [{ name: '上海' }, { name: '重庆', value: 50 }],
//      [{ name: '上海' }, { name: '长沙', value: 40 }],
//      [{ name: '上海' }, { name: '北京', value: 30 }],
//      [{ name: '上海' }, { name: '丹东', value: 20 }],
//      [{ name: '上海' }, { name: '大连', value: 10 }]
//  ];

//  var GZData = [
//      [{ name: '广州' }, { name: '福州', value: 95 }],
//      [{ name: '广州' }, { name: '太原', value: 90 }],
//      [{ name: '广州' }, { name: '长春', value: 80 }],
//      [{ name: '广州' }, { name: '重庆', value: 70 }],
//      [{ name: '广州' }, { name: '西安', value: 60 }],
//      [{ name: '广州' }, { name: '成都', value: 50 }],
//      [{ name: '广州' }, { name: '常州', value: 40 }],
//      [{ name: '广州' }, { name: '北京', value: 30 }],
//      [{ name: '广州' }, { name: '北海', value: 20 }],
//      [{ name: '广州' }, { name: '海口', value: 10 }]
//  ];


/**
 * 数据格式转换函数
 * 将 
   [[{name:'北京'}, {name:'上海',value:95}],
    [{name:'北京'}, {name:'广州',value:90}],...]
   结合
   [ '上海': [121.4648,31.2891],
    '东莞': [113.8953,22.901],
    '东营': [118.7073,37.5513],
    '中山': [113.4229,22.478],...]
   转换为
   [{"fromName":"北京","toName":"拉萨","coords":[[116.4551,40.2539],[91.1865,30.1465]]},
   {"fromName":"北京","toName":"南宁","coords":[[116.4551,40.2539],[108.479,23.1152]]},...]
 */
var convertData = function (data) {
    var res = [];
    for (var i = 0; i < data.length; i++) {
        var dataItem = data[i];
        var fromCoord = geoCoordMap[dataItem[0].name];
        var toCoord = geoCoordMap[dataItem[1].name];
        if (fromCoord && toCoord) {
            res.push({
                fromName: dataItem[0].name,
                toName: dataItem[1].name,
                coords: [fromCoord, toCoord]
            });
        }
    }
    return res;
};

//自定义图形配色
var color = ['#a6c84c', '#ffa022', '#46bee9'];
//通过循环生成series配置
var series = [];
[
    ['北京', BJdata]
].forEach(function (item, i) {
    series.push({
        name: item[0] + ' Top10',
        type: 'lines',
        zlevel: 1,
        effect: {
            show: true,
            period: 6,
            trailLength: 0.7,
            color: '#fff',
            symbolSize: 3
        },
        lineStyle: {
            normal: {
                color: color[i],
                width: 0,
                curveness: 0.2
            }
        },
        //使用定义好的数据格式转换函数生成lines的数据
        data: convertData(item[1])
    }, {
        name: item[0] + ' Top10',
        type: 'lines',
        zlevel: 2,
        symbol: ['none', 'arrow'],
        symbolSize: 10,
        effect: {
            show: true,
            period: 10,
            trailLength: 0,
            symbol: 'rect',
            symbolSize: 8
        },
        lineStyle: {
            normal: {
                color: color[i],
                width: 1,
                opacity: 0.6,
                curveness: 0.2
            }
        },
        data: convertData(item[1])
    }, {
        name: item[0] + ' Top10',
        type: 'effectScatter',
        coordinateSystem: 'geo',
        zlevel: 2,
        rippleEffect: {
            brushType: 'stroke'
        },
        label: {
            normal: {
                show: true,
                position: 'right',
                formatter: '{b}',
                position: 'end'
            }
        },
        symbolSize: function (val) {
            return val[2] / 8;
        },
        itemStyle: {
            normal: {
                color: color[i]
            }
        },
        //生成散点图数据[{"name":"拉萨","value":[91.1865,30.1465,50]},...]
        data: item[1].map(function (dataItem) {
            return {
                name: dataItem[1].name,
                value: geoCoordMap[dataItem[1].name].concat([dataItem[1].value])
            };
        })
    });
});

var option = {
    backgroundColor: '#404a59',
    title: {
        text: '借官方示例学习一下series[i]-lines用法',
        subtext: '数据纯属虚构',
        left: 'center',
        textStyle: {
            color: '#fff'
        }
    },
    tooltip: {
        trigger: 'item'
    },
    legend: {
        orient: 'vertical',
        top: 'bottom',
        left: 'right',
        data: ['北京 Top10', '上海 Top10', '广州 Top10'],
        textStyle: {
            color: '#fff'
        },
        selectedMode: 'single'
    },
    geo: {
        map: 'china',
        label: {
            emphasis: {
                show: false
            }
        },
        roam: true,
        itemStyle: {
            normal: {
                areaColor: '#323c48',
                borderColor: '#404a59'
            },
            emphasis: {
                areaColor: '#2a333d'
            }
        }
    },
    series: series
};
myChart.setOption(option);